Churn Modeling

In [2]:
import tensorflow
tensorflow.__version__

'2.6.0'

In [4]:
# importing all the importand libraries
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

# tensorflow lib
import tensorflow
from tensorflow.keras.models import Sequential
# fully connected network, ANN and sequential are same
from tensorflow.keras.layers import Dense, Dropout
# to create different layers like hidden layer, input, output layer etc

In [5]:
!pwd

/content

In [6]:
!ls

drive  sample_data

In [7]:
cd drive/MyDrive/

/content/drive/MyDrive

In [8]:
ls

 20_aug_85.h5                               panchani_img
 Churn_Modelling.csv                       'POA - Tracker (1).xlsx'
'Colab Notebooks'/                          Ted.Lasso.S02E01.LIGHTDLSERIES.mp4
 fb528705-a8bd-440d-899b-3383b2b7bf56.jpg   Ted.Lasso.S02E02.LIGHTDLSERIES.mp4

In [9]:
# reading the file
data = pd.read_csv('Churn_Modelling.csv')

data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

# second way
connect google drive with google colab
files > mountdirive

In [10]:
!pwd

/content/drive/My Drive

In [11]:
cd /content/drive/MyDrive

/content/drive/MyDrive

In [12]:
ls

 20_aug_85.h5                               panchani_img
 Churn_Modelling.csv                       'POA - Tracker (1).xlsx'
'Colab Notebooks'/                          Ted.Lasso.S02E01.LIGHTDLSERIES.mp4
 fb528705-a8bd-440d-899b-3383b2b7bf56.jpg   Ted.Lasso.S02E02.LIGHTDLSERIES.mp4

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [14]:
X = data.iloc[: , 3:13]
y = data.iloc[:, 13]

In [15]:
X

      CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0             619    France  Female  ...          1               1        101348.88
1             608     Spain  Female  ...          0               1        112542.58
2             502    France  Female  ...          1               0        113931.57
3             699    France  Female  ...          0               0         93826.63
4             850     Spain  Female  ...          1               1         79084.10
...           ...       ...     ...  ...        ...             ...              ...
9995          771    France    Male  ...          1               0         96270.64
9996          516    France    Male  ...          1               1        101699.77
9997          709    France  Female  ...          0               1         42085.58
9998          772   Germany    Male  ...          1               0         92888.52
9999          792    France  Female  ...          1               0         38190.78

[10000 rows x 10 columns]

In [16]:
y

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [17]:
geography = pd.get_dummies(X['Geography'], drop_first=True) # One hot Encoding
gender  = pd.get_dummies(X['Gender'], drop_first=True)

In [18]:
X = pd.concat([X, geography, gender], axis=1)

In [19]:
X

      CreditScore Geography  Gender  Age  ...  EstimatedSalary  Germany  Spain  Male
0             619    France  Female   42  ...        101348.88        0      0     0
1             608     Spain  Female   41  ...        112542.58        0      1     0
2             502    France  Female   42  ...        113931.57        0      0     0
3             699    France  Female   39  ...         93826.63        0      0     0
4             850     Spain  Female   43  ...         79084.10        0      1     0
...           ...       ...     ...  ...  ...              ...      ...    ...   ...
9995          771    France    Male   39  ...         96270.64        0      0     1
9996          516    France    Male   35  ...        101699.77        0      0     1
9997          709    France  Female   36  ...         42085.58        0      0     0
9998          772   Germany    Male   42  ...         92888.52        1      0     1
9999          792    France  Female   28  ...         38190.78        0      0     0

[10000 rows x 13 columns]

In [20]:
X = X.drop(columns = ['Geography', 'Gender'], axis = 1)

In [21]:
X

      CreditScore  Age  Tenure  ...  Germany  Spain  Male
0             619   42       2  ...        0      0     0
1             608   41       1  ...        0      1     0
2             502   42       8  ...        0      0     0
3             699   39       1  ...        0      0     0
4             850   43       2  ...        0      1     0
...           ...  ...     ...  ...      ...    ...   ...
9995          771   39       5  ...        0      0     1
9996          516   35      10  ...        0      0     1
9997          709   36       7  ...        0      0     0
9998          772   42       3  ...        1      0     1
9999          792   28       4  ...        0      0     0

[10000 rows x 11 columns]

In [22]:
# Scaling the features
#sc = StandardScaler()
#X = sc.fit_transform(X)

In [23]:
X

      CreditScore  Age  Tenure  ...  Germany  Spain  Male
0             619   42       2  ...        0      0     0
1             608   41       1  ...        0      1     0
2             502   42       8  ...        0      0     0
3             699   39       1  ...        0      0     0
4             850   43       2  ...        0      1     0
...           ...  ...     ...  ...      ...    ...   ...
9995          771   39       5  ...        0      0     1
9996          516   35      10  ...        0      0     1
9997          709   36       7  ...        0      0     0
9998          772   42       3  ...        1      0     1
9999          792   28       4  ...        0      0     0

[10000 rows x 11 columns]

In [24]:
# Splitting the dataset
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 101)

In [25]:
# feature scaling
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [26]:
#1. Architecture creation
#2. Compile
#3. Model train

In [27]:
#1. Model creation
model = Sequential()
model.add(Dense(100, activation='relu', kernel_initializer='he_uniform')) #hidden layer 1
model.add(Dropout(0.2))

model.add(Dense(50, activation='sigmoid',)) #hidden layer 2
model.add(Dropout(0.5))

model.add(Dense(25, activation='relu', kernel_initializer='he_uniform')) #hidden layer 3
model.add(Dense(12, activation='relu', kernel_initializer='he_uniform')) #hidden layer 4

model.add(Dense(1, activation='sigmoid')) #output layer

In [28]:
#2. Compile the model
model.compile(optimizer='SGD', loss = 'binary_crossentropy', metrics=['accuracy']) #log loss

In [29]:
#3. Model train
model.fit(X_train, y_train, epochs = 20, batch_size=32) # train set is 80% which is 8000 rows. 8000/32 = 250 rows in each epoch

Epoch 1/20
250/250 [==============================] - 4s 2ms/step - loss: 0.5369 - accuracy: 0.7700
Epoch 2/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4996 - accuracy: 0.7980
Epoch 3/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4918 - accuracy: 0.7984
Epoch 4/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4847 - accuracy: 0.7986
Epoch 5/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4851 - accuracy: 0.7979
Epoch 6/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4774 - accuracy: 0.7983
Epoch 7/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4730 - accuracy: 0.7985
Epoch 8/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4685 - accuracy: 0.7990
Epoch 9/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4685 - accuracy: 0.7983
Epoch 10/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4676 - accuracy: 0.7972
Epoch 11/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4643 - accuracy: 0.7987
Epoch 12/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4618 - accuracy: 0.7987
Epoch 13/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4597 - accuracy: 0.7994
Epoch 14/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4596 - accuracy: 0.7974
Epoch 15/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4574 - accuracy: 0.7984
Epoch 16/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4523 - accuracy: 0.8005
Epoch 17/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4554 - accuracy: 0.8016
Epoch 18/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4505 - accuracy: 0.8008
Epoch 19/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4485 - accuracy: 0.8015
Epoch 20/20
250/250 [==============================] - 0s 2ms/step - loss: 0.4508 - accuracy: 0.8010

In [30]:
9# check accuracy on testing data
model.evaluate(X_test, y_test)
# gives us [loss, accuracy]

63/63 [==============================] - 0s 2ms/step - loss: 0.4296 - accuracy: 0.7920

[0.4296168088912964, 0.7919999957084656]

In [31]:
pwd

'/content/drive/MyDrive'

In [32]:
model.save('20_aug_85.h5')

In [33]:
# loading of the model

from keras.models import load_model

model_load = load_model('20_aug_85.h5')

In [34]:
model_load.predict(X_test)

array([[0.14739099],
       [0.05520152],
       [0.27814963],
       ...,
       [0.14059538],
       [0.10019813],
       [0.4703782 ]], dtype=float32)

In [35]:
y_pred =model_load.predict(X_test) > 0.5
y_pred

array([[False],
       [False],
       [False],
       ...,
       [False],
       [False],
       [False]])

Note: Pipeline has to be forward
While training --> data --> scaling ---> fit
while testing --> data --> scaling ---> fit

In [36]:
a = 10
b = 1000
c = 100
d = 10000
e = 10
f = 10000
g = 100
h = 1000
i = 100
j = 100000
k = 100

scaling = joblib.load('feature_scaling.pkl')
data = scaling.transform([[a,b,c,d,e,f,g,h,i,j,k]])

print(data)
output = model_load.predict(data) > 0.5
# 0.5 is threshold. Threshold value depends on AUC and ROC curve

if output[0][0] == True:
  print('he/she will leave')
else:
  print('he/she will stay')

he/she will stay